#!/usr/bin/env brew bundle install
# Yes, that shebang is magic.  Just execute this file via ./Brewfile to make it work.

brew 'coreutils'
brew 'gnu-sed'  # --with-default-names
brew 'findutils'  # --with-default-names
brew 'grep'  # --with-default-names
brew 'progress'  # https://github.com/Xfennec/progress
brew 'direnv'
brew 'pv'

brew 'git'
brew 'hub'
brew 'bash'
brew 'bash-completion'
brew 'wget'
brew 'colordiff'
# FIXME: figure out how to run this via brew?
# $(brew --prefix)/bin/pip install virtualenvwrapper ipython

brew 'imagemagick'

brew 'libdvdcss'
brew 'mp4v2'
brew 'gpac'

brew 'ssh-copy-id'
brew 'rename'

brew 'html-xml-utils'

brew 'hugo'
brew 'tree'

# Better than Apple's built-in one
brew 'nano'

# for json parsing via bash
brew 'jq'

# for photorec, memory card un-deleter
brew 'testdisk'

# http://www.kodiakskorner.com/log/258


# http://lapwinglabs.com/blog/hacker-guide-to-setting-up-your-mac

tap 'caskroom/cask'
tap 'caskroom/versions'

tap 'caskroom/fonts'
cask 'font-hack'
cask 'font-fira-code'
cask 'font-monoid'
cask 'font-source-code-pro'
# for seagl program
cask 'font-dosis'


# https://github.com/caskroom/homebrew-cask/tree/master/Casks

# This includes the betterzipql plugin, too
cask 'betterzip'

# Great list of QL plugins via https://github.com/sindresorhus/quick-look-plugins
# See also https://www.quicklookplugins.com/
cask 'ProvisionQL'
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'
cask 'quicklookase'
cask 'qlvideo'
#  sad..  no longer available: cert-quicklook
